cmsis-svd/cmsis-svd/data/Renesas/R7FA2E1A9.svd
                <register>
                    <name>MSPMPUOAD</name>
                    <description>Stack Pointer Monitor Operation After Detection Register</description>
                    <addressOffset>0xD00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>OAD</name>
                            <description>Operation after Detection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-maskable interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUCTL</name>
                    <description>Stack Pointer Monitor Access Control Register</description>
                    <addressOffset>0xD04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xfeff</resetMask>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Stack Pointer Monitor Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stack pointer monitor is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer monitor is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ERROR</name>
                            <description>Stack Pointer Monitor Error Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stack pointer has not overflowed or underflowed</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer has overflowed or underflowed</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUPT</name>
                    <description>Stack Pointer Monitor Protection Register</description>
                    <addressOffset>0xD06</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stack pointer monitor register writes are permitted.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer monitor register writes are protected. Reads are permitted</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUSA</name>
                    <description>Main Stack Pointer (MSP) Monitor Start Address Register</description>
                    <addressOffset>0xD08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>MSPMPUSA</name>
                            <description>Region Start Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00000</minimum>
                                    <maximum>0x200FFFFC</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUEA</name>
                    <description>Main Stack Pointer (MSP) Monitor End Address Register</description>
                    <addressOffset>0xD0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>MSPMPUEA</name>
                            <description>Region End Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00003</minimum>
                                    <maximum>0x200FFFFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUOAD</name>
                    <description>Stack Pointer Monitor Operation After Detection Register</description>
                    <addressOffset>0xD10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>OAD</name>
                            <description>Operation after Detection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-maskable interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUCTL</name>
                    <description>Stack Pointer Monitor Access Control Register</description>
                    <addressOffset>0xD14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xfeff</resetMask>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Stack Pointer Monitor Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stack pointer monitor is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer monitor is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ERROR</name>
                            <description>Stack Pointer Monitor Error Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stack pointer has not overflowed or underflowed</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer has overflowed or underflowed</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUPT</name>
                    <description>Stack Pointer Monitor Protection Register</description>
                    <addressOffset>0xD16</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stack pointer monitor register writes are permitted.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer monitor register writes are protected. Reads are permitted</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUSA</name>
                    <description>Process Stack Pointer (PSP) Monitor Start Address Register</description>
                    <addressOffset>0xD18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>PSPMPUSA</name>
                            <description>Region Start Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00000</minimum>
                                    <maximum>0x200FFFFC</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUEA</name>
                    <description>Process Stack Pointer (PSP) Monitor End Address Register</description>
                    <addressOffset>0xD1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>PSPMPUEA</name>
                            <description>Region End Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00003</minimum>
                                    <maximum>0x200FFFFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
