cmsis-svd/cmsis-svd/data/Renesas/R7FA2E1A9.svd
                <register>
                    <name>GTPBR</name>
                    <description>General PWM Timer Cycle Setting Buffer Register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>GTDTCR</name>
                    <description>General PWM Timer Dead Time Control Register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TDE</name>
                            <description>Negative-Phase Waveform Setting</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRB is set without using GTDVU</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTDVU is used to set the compare match value for negative-phase waveform with dead time automatically in GTCCRB</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTDVU</name>
                    <description>General PWM Timer Dead Time Value Register U</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPT164">
            <name>GPT165</name>
            <description>General PWM 16-bit Timer 5</description>
            <baseAddress>0x40078500</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT164">
            <name>GPT166</name>
            <description>General PWM 16-bit Timer 6</description>
            <baseAddress>0x40078600</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT164">
            <name>GPT167</name>
            <description>General PWM 16-bit Timer 7</description>
            <baseAddress>0x40078700</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT164">
            <name>GPT168</name>
            <description>General PWM 16-bit Timer 8</description>
            <baseAddress>0x40078800</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT164">
            <name>GPT169</name>
            <description>General PWM 16-bit Timer 9</description>
            <baseAddress>0x40078900</baseAddress>
        </peripheral>
        <peripheral>
            <name>GPT_OPS</name>
            <description>Output Phase Switching Controller</description>
            <baseAddress>0x40078FF0</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>OPSCR</name>
                    <description>Output Phase Switching Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>UF</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VF</name>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WF</name>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U</name>
                            <description>Input U-Phase Monitor</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>V</name>
                            <description>Input V-Phase Monitor</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>W</name>
                            <description>Input W-Phase Monitor</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Output Phase Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not output (Hi-Z external pin)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FB</name>
                            <description>External Feedback Signal Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Select the external input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Select the soft setting (OPSCR.UF, VF, WF)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P</name>
                            <description>Positive-Phase Output (P) Control</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Level signal output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>PWM signal output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>N</name>
                            <description>Negative-Phase Output (N) Control</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Level signal output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>PWM signal output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>Output Phase Invert Control</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Positive logic (active-high) output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Negative logic (active-low) output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RV</name>
                            <description>Output Phase Rotation Direction Reversal Control</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Positive rotation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reverse rotation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ALIGN</name>
                            <description>Input Phase Alignment</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Input phase aligned to PCLKD</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Input phase aligned to the falling edge of PWM</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GRP</name>
                            <description>Output Disabled Source Selection</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GODF</name>
                            <description>Group Output Disable Function</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>This bit function is ignored</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Group disable clears the OPSCR.EN bit</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFEN</name>
                            <description>External Input Noise Filter Enable</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not use a noise filter on the external input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Use a noise filter on the external input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFCS</name>
                            <description>External Input Noise Filter Clock Selection</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>PCLKD/1</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>PCLKD/4</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>PCLKD/16</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>PCLKD/64</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
